# for i in range(0, 11, 2):
#     print(f"Ваши значения - {i}")
#     for j in range(0, 11, 2):
#         print(f"Ваши вложенные значения: - {j}")
#
# print(None)
#
# for k in range(12, 0, - 2):
#     print(f"Ваши значения - {k}")
#     for l in range(12, 0, - 2):
#         print(f"Ваши вложенные значения: - {l}")


# word = "Python"
#
# for i in word:
#     print(i, end=" ")

# Задача №035.
# you_name = input("Введите своё имя: ")
#
# for i in range(0, 3):
#     print(you_name)


# Задача №036.
# you_name = input("Введите своё имя: ")
# digits = int(input("Введите число: "))
#
# for i in range(0, digits):
#     print(you_name)


# Задача №037.
# you_name = input("Введите своё имя: ")
#
# for i in you_name:
#     print(i)

# Задача №038.
you_name = input("Введите своё имя: ")
digits = int(input("Введите число: "))

for i in you_name:
    print(i)
