import math     # Подключил библиотеку математических функций

# num = 12.5678
# print(round(num, 2)) # Вывод 12.58
# print(10 ** 2)
# num2 = 120
# print(math.sqrt(num2))
# print(round(math.sqrt(num2), 2))
#
# print(round(15 / 7, 2))
# print(15 // 7)
# print(15 / 2)
# print(15 % 2)

# Задача №027.  Предложите пользователю ввести число
# с большим количеством знаков в дробной
# части. Умножьте это число на 2 и выведите ответ.
# num_dot = float(input("Введите число с большим количеством знаков, после запятой: "))
# result = num_dot * 2
#
# print(result)

# Задача №028. Измените программу из задачи 027 так, чтобы она
# выводила результат с точностью до двух знаков
# в дробной части.
# num_dot = float(input("Введите число с большим количеством знаков, после запятой: "))
# result = num_dot * 2
#
# print(round(result, 2))

# Задача №029. Предложите пользователю ввести целое число больше 500.
# Вычислите квадратный корень из этого числа и выведите его с точностью
# до двух знаков в дробной части
# num_2 = int(input("Введите целое число больше 500: "))
# sqrt = round(math.sqrt(num_2), 2)
#
# print(sqrt)

# Задача №030. Выведите число «пи» (π) с точностью до 5 знаков.
# print(round(math.pi, 5))

# Задача 031. Предложите пользователю ввести радиус круга (рас
# стояние от центра до внешней границы.) Вычислите
# площадь круга (π * радиус2)
# radius = int(input("Введите радиус круга: "))
# sqrt_circle = math.pi * radius * radius
#
# print(sqrt_circle)

# Задача №032. Предложите пользователю ввести радиус
# и высоту цилиндра. Вычислите его объем (площадь круга * высота)
# и выведите его с точностью до трех знаков.
# sqrt_cylinder = float(input("Введите радиус цилиндра: "))
# cylinder_height = float(input("Введите высоту цилиндра: "))
# volume = sqrt_cylinder * cylinder_height
#
# print(round(volume, 3))

# Задача №033. Предложите пользователю ввести два числа. Используйте целочисленное деление,
# чтобы разделить первое число на второе; вычислите остаток и выведите
# ответ в виде, удобном для пользователя (например, если пользователь ввел 7 и 2,
# выведите строку вида «если разделить 7 на 2, получится 3 с остатком 1»).
